### Conectar pandas a la BD y crear columnas calculadas en el DataFrame

In [1]:
from base_datos import BaseDatos
import pandas as pd

In [6]:
# La conexión a la BD:
bd = BaseDatos("../BBDD/empresa3.db")

Cerrando conexión ...

In [7]:
bd.con

In [8]:
sql = """select p.idpedido, p.idcliente, e.nombre as empresa, emp.nombre as empleado, p.pais,
p.importe from pedidos 
p inner join empresasenvios e on p.idempresaenvio = e.id
inner join empleados emp on p.idempleado = emp.id"""

In [9]:
df = pd.read_sql(sql, bd.con)
df.head()

   idpedido idcliente           empresa   empleado            pais  importe
0      9999     A1234    Speedy Express    Davolio  Estados Unidos    99.00
1     10248     WILMK  Federal Shipping   Buchanan       Finlandia    32.38
2     10249     TOMSP    Speedy Express     Suyama        Alemania    11.61
3     10250     HANAR    United Package    Peacock          Brasil    65.83
4     10251     VICTE    Speedy Express  Leverling         Francia    41.34